config.org
* MOUSE SCROLLING
Emacs' default scrolling is annoying because of the sudden half-page jumps.  Also, I wanted to adjust the scrolling speed.

#+begin_src emacs-lisp
(setq scroll-conservatively 101) ;; value greater than 100 gets rid of half page jumping
(setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; how many lines at a time
(setq mouse-wheel-progressive-speed t) ;; accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
#+end_src

* TREEMACS
#+begin_src elisp
(use-package treemacs
  :defer t
  :config
  ;; Add ignored files and file extensions
  (setq treemacs-file-ignore-extensions '("o" "gcna" "gcdo" "vscode" "idea")
        treemacs-file-ignore-globs nil)
  (defun my-treemacs-ignore-filter (file full-path)
    "Ignore files specified by `treemacs-file-ignore-extensions' and globs."
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (cl-loop for glob in treemacs-file-ignore-globs
                 thereis (file-name-match-glob glob full-path))))
  (add-to-list 'treemacs-ignored-file-predicates #'my-treemacs-ignore-filter)

  ;; Enable follow mode
  (treemacs-follow-mode t)

  ;; Set treemacs theme
  (setq doom-themes-treemacs-theme "doom-colors"))
#+end_src

* PYTHON
** Black For Python Format
#+begin_src elisp
(use-package! python-black
  :demand t
  :after python
  :config
  (add-hook! 'python-mode-hook #'python-black-on-save-mode)
  (map! :leader :desc "Blacken Buffer" "m b b" #'python-black-buffer)
  (map! :leader :desc "Blacken Region" "m b r" #'python-black-region)
  (map! :leader :desc "Blacken Statement" "m b s" #'python-black-statement)
  )
#+end_src

* WEB
** REACT
*** Add Web Mode To React
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.js[x]?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.ts[x]?\\'" . web-mode))
#+END_SRC

** ASTRO
*** Add Web Mode To Astro File
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.astro\\'" . web-mode))
#+END_SRC

** HTML.ERB
*** Add ERB to lsp-mode
#+BEGIN_SRC emacs-lisp
(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(".*\\.html\\.erb$" . "html"))
  (setq lsp-ui-sideline-show-code-actions t))
#+END_SRC

*** Add Web Mode to ERB template and disable format on save
#+BEGIN_SRC emacs-lisp
(add-hook! 'web-mode-hook
  (when (string-match-p "\\.erb\\'" buffer-file-name)
    (setq +format-with :none)))
#+END_SRC


** CUSTOM WEB-MODE
#+BEGIN_SRC emacs-lisp
(use-package web-mode
  :custom
  (web-mode-markup-indent-offset 2)
  (web-mode-css-indent-offset 2)
  (web-mode-code-indent-offset 2)
  :config
  (setq web-mode-tag-auto-close-style 1))
#+END_SRC

** RJSX MINOR MODE
*** Add Hook Function for JSX and TSX files
#+BEGIN_SRC emacs-lisp
(defun enable-rjsx-mode ()
  (when (or (string-equal "jsx" (file-name-extension buffer-file-name))
            (string-equal "tsx" (file-name-extension buffer-file-name)))
    (rjsx-minor-mode)))

(add-hook 'web-mode-hook #'enable-rjsx-mode)
#+END_SRC

** PRETTIER-RC
*** Add Hook Function for JSX and TSX files
#+BEGIN_SRC emacs-lisp
(defun enable-prettier-mode ()
  (when (or (string-equal "jsx" (file-name-extension buffer-file-name))
            (string-equal "tsx" (file-name-extension buffer-file-name)))
    (prettier-rc-mode)))

(add-hook 'web-mode-hook #'enable-prettier-mode)
#+END_SRC

* CENTAUR-TABS
** To fix centaur tabs in emacsclient
#+begin_src elisp
(after! centaur-tabs
  (setq centaur-tabs-set-bar 'right))
#+end_src

** Add Custom map
Keymap to turn ON/OFF centaur tabs

#+begin_src elisp
(map! :leader
      :desc "Toggle Centaur Tabs" "t a" #'centaur-tabs-mode)
#+end_src

** Move Between Buffer
Key mapping to move previous and next buffer with and without centaur-tabs

*** Default
#+begin_src elisp
(map! :ni "C-," #'previous-buffer)
(map! :ni "C-;" #'next-buffer)
#+end_src

*** Centaur Tabs
If Centaur Tabs is loaded map this key to switch between tabs instead of buffers

#+begin_src elisp
(eval-after-load 'centaur-tabs
    (map! :ni "C-," #'centaur-tabs-backward))
(eval-after-load 'centaur-tabs
    (map! :ni "C-;" #'centaur-tabs-forward))
#+end_src

* CRYSTAL
At the moment, lsp-mode only knows about scry as the Crystal language server.
So, to get it working with crystalline we need to configure lsp-mode to look for crystalline.

#+begin_src elisp
(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration
               '(crystal-mode . "crystal"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("crystalline"))
                    :activation-fn (lsp-activate-on "crystal")
                    :priority '1
                    :server-id 'crystalline)))
#+end_src

* IMPORT OTHER CONFIG
Use external rails config, for snippet and method to navigate easily in rails project

#+begin_src elisp
(load (expand-file-name "rails-settings.el" doom-user-dir))
(load (expand-file-name "crystal-settings.el" doom-user-dir))
#+end_src

* INFORMATION
 Whenever you reconfigure a package, make sure to wrap your config in an
 `after!' block, otherwise Doom's defaults may override your settings. E.g.

   (after! PACKAGE
     (setq x y))

 The exceptions to this rule:

   - Setting file/directory variables (like `org-directory')
   - Setting variables which explicitly tell you to set them before their
     package is loaded (see 'C-h v VARIABLE' to look up their documentation).
   - Setting doom variables (which start with 'doom-' or '+').

 Here are some additional functions/macros that will help you configure Doom.

 - `load!' for loading external *.el files relative to this one
 - `use-package!' for configuring packages
 - `after!' for running code after a package has loaded
 - `add-load-path!' for adding directories to the `load-path', relative to
   this file. Emacs searches the `load-path' when you load packages with
   `require' or `use-package'.
 - `map!' for binding new keys

 To get information about any of these functions/macros, move the cursor over
 the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
 This will open documentation for it, including demos of how they are used.
 Alternatively, use `C-h o' to look up a symbol (functions, variables, faces,
 etc).
 You can also try 'gd' (or 'C-c c d') to jump to their definition and see how

 they are implemented.
